<template>
    <div class="main">
        <nav_2></nav_2>
        <div class="pages">
            <lineNav @msg="moveto" ref="linenav"></lineNav>
            <div class="page" :id="5" ref="id5">
                <muban ref="move4" :msg="msg.jqxx"></muban>
            </div>
            <div class="page" :id="4" ref="id4">
                <muban ref="move3" :msg="msg.ht"></muban>
            </div>
            <div class="page" :id="3" ref="id3">
                <muban ref="move2" :msg="msg.fwd"></muban>
            </div>
            <div class="page" :id="2" ref="id2">
                <muban ref="move1" :msg="msg.qd"></muban>
            </div>
            <div class="page page1" :id="1" ref="id1">
                <why @pagevalue="moveto2"></why>
            </div>
        </div>
    </div>
</template>
<script>
import nav_2 from "../public/nav_2";
import lineNav from "./lineNav";
import muban from "./muban";
import why from "./why";
export default {
    data() {
        return {
            id: 1,
            line: true,
            pre: "",
            msg: {
                qd: {
                    id: 1,
                    title1: "前端",
                    title2: "技术的可视化展示窗口",
                    font1:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font2:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font3:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    pic1: require("../../../assets/img/组别/前端/pic1.jpg"),
                    pic2_1: require("../../../assets/img/组别/前端/pic2.jpg"),
                    pic2_2: require("../../../assets/img/组别/前端/pic2.jpg"),
                    pic2_3: require("../../../assets/img/组别/前端/pic2.jpg"),
                },
                fwd: {
                    id: 2,
                    title1: "服务端",
                    title2: "服务器中的相关操作",
                    font1:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font2:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font3:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                },
                ht: {
                    id: 3,
                    java: {
                        title1: "JAVA",
                        title2: "数据处理与逻辑实现",
                        font1:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                        font2:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                        font3:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    },
                    go: {
                        title1: "GO",
                        title2: "数据处理与逻辑实现",
                        font1:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                        font2:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                        font3:
                            "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    },
                },
                jqxx: {
                    id: 4,
                    title1: "机器学习",
                    title2: "人工智能与数据挖掘",
                    font1:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font2:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                    font3:
                        "这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字这里是文字",
                },
            },
        };
    },
    components: {
        nav_2,
        lineNav,
        why,
        muban,
    },
    methods: {
        moveto(msg) {
            this.pre = msg.pre;
            this.id = msg.value;
        },
        moveto2(value) {
            this.pre = 1;
            this.id = value;
            this.$refs.linenav.changenowpage(value);
        },
    },
    watch: {
        id(value) {
            this.$refs["id" + value].style.zIndex = "99";
            this.$refs["id" + value].style.marginTop = "0vh";
            for (let i = 1; i < value; i++) {
                this.$refs["id" + i].style.zIndex = "10";
                setTimeout(() => {
                    this.$refs["id" + i].style.marginTop = "-180vh";
                }, 1200);
            }
            for (let i = value + 1; i <= 5; i++) {
                this.$refs["id" + i].style.zIndex = "10";
                setTimeout(() => {
                    this.$refs["id" + i].style.marginTop = "-180vh";
                }, 1200);
            }
        },
        pre(value) {
            if (value != 1) {
                this.$refs["move" + (value - 1)].changepage();
            }
        },
    },
};
</script>
<style scoped>
.main {
    width: 100%;
    height: 100%;
}
.pages {
    width: 100%;
    height: 100vh;
    overflow: hidden;
}
.page {
    position: absolute;
    width: 100%;
    height: 100vh;
    background-color: rgb(235, 238, 238);
    color: black;
    font-size: 10vw;
    margin-top: -180vh;
    transition: 1.2s ease-in-out;
    box-shadow: 0 0 15px rgb(0, 0, 0);
}
.page1 {
    margin-top: 0;
}

</style>